app/controllers/todo_items_controller.rb

def create
 @todo_item = @todo_list.todo_items.create(todo_item_params)
---
INSERT INTO "todo_items" ("content", "todo_list_id", "created_at", "updated_at", "priority", "due_date") VALUES (?, ?, ?, ?, ?, ?)  [["content", "qqqqq"], ["todo_list_id", 2], ["created_at", "2020-05-21 01:13:52.212375"], ["updated_at", "2020-05-21 01:13:52.212375"], ["priority", 35], ["due_date", "2020-12-01 00:00:00"]]

def destroy
 @todo_item = @todo_list.todo_items.find(params[:id])
 if @todo_item.destroy
---
SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT ?  [["todo_list_id", 2], ["id", 15], ["LIMIT", 1]]
DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 15]]