app/controllers/todo_lists_controller.rb

SELECT "todo_lists".* FROM "todo_lists" ORDER BY "todo_lists"."created_at" DESC
---
  def index
    @todo_lists = TodoList.all

INSERT INTO "todo_lists" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test titile "], ["description", "test desc"], ["created_at", "2020-05-20 00:56:55.167541"], ["updated_at", "2020-05-20 00:56:55.167541"]]
---
  def create
    @todo_list = TodoList.new(todo_list_params)

    respond_to do |format|
      if @todo_list.save

DELETE FROM "todo_lists" WHERE "todo_lists"."id" = ?  [["id", 1]]
---
def destroy
    @todo_list.destroy

SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? ORDER BY "todo_lists"."created_at" DESC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_todo_list
      @todo_list = TodoList.find(params[:id])